InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/дог_ФормаЦеныИВалюта/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ВозможноОткрытьФорму() Тогда
		
		ВалютаУчета = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("ВалютаРегламентированногоУчета");
		ДатаКурсаВзаиморасчетов = Параметры.ДанныеДокумента.Дата;
		ДатаКурсаДокумента = Параметры.ДанныеДокумента.Дата;
		
		СохранитьЗначенияПриОткрытии();
		ЗаполнитьКурсыВалют();
		ЗаполнитьРеквизитыФормы(Параметры.ДанныеДокумента);
		ЗаполнитьСписокВыбораВалютаДокумента();
		ИзменитьФормуЕслиЭтоВызовПриИзмененииДоговора();
		
		УправлениеФормой(ЭтаФорма, Истина);
		
	Иначе
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	ОбработатьИзмененияТипаЦен(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзмененияТипаЦен(Форма)
	
	Если Форма.УчитыватьНДС ИЛИ Форма.УчитыватьАкциз Тогда
		РеквизитыТипаЦен = РеквизитыТипаЦен(Форма.ТипЦен);
		Форма.СуммаВключаетНДС = ?(Форма.УчитыватьНДС, РеквизитыТипаЦен.ЦенаВключаетНДС, Ложь);
		Форма.СуммаВключаетАкциз = ?(Форма.УчитыватьАкциз, РеквизитыТипаЦен.ЦенаВключаетАкциз, Ложь);
	КонецЕсли;	
	
	Форма.ПерезаполнитьЦены = ЗначениеЗаполнено(Форма.ТипЦен) И НЕ Форма.ТипЦен = Форма.ЗначенияПриОткрытии.ТипЦен;
	
	Форма.Модифицированность = ЗначенияИзменились(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ОбработатьИзменениеВалютыДокумента(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеВалютыДокумента(Форма)
	
	Если Форма.ВалютаВзаиморасчетов = Форма.ВалютаДокумента Тогда
		Форма.КурсДокумента = Форма.КурсВзаиморасчетов;	
	Иначе
		Форма.КурсДокумента = КурсВалюты(Форма.ВалютаДокумента, Форма.КурсыВалют)	
	КонецЕсли;
	
	Если Форма.ВалютаВзаиморасчетов = Форма.ВалютаДокумента Тогда
		Форма.КратностьДокумента = Форма.КратностьВзаиморасчетов;	
	Иначе
		Форма.КратностьДокумента = КратностьВалюты(Форма.ВалютаДокумента, Форма.КурсыВалют);	
	КонецЕсли;
	
	Форма.ПересчитатьЦены = ?(Форма.ВалютаДокумента = Форма.ЗначенияПриОткрытии.ВалютаДокумента, Ложь, Истина) И Форма.Параметры.ПараметрыОткрытия.ЕстьЗаполненныеТабличныеЧасти;
	
	Форма.Модифицированность = ЗначенияИзменились(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура КурсДокументаПриИзменении(Элемент)
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КратностьДокументаПриИзменении(Элемент)
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаВзаиморасчетовПриИзменении(Элемент)
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура КурсВзаиморасчетовПриИзменении(Элемент)
	
	КурсДокумента = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КурсВзаиморасчетов, КурсДокумента);	
	КратностьДокумента = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КратностьВзаиморасчетов, КратностьДокумента);
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КратностьВзаиморасчетовПриИзменении(Элемент)
	
	КратностьДокумента = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КратностьВзаиморасчетов, КратностьДокумента);
	
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	
	Если НЕ УчитыватьНДС Тогда
		СуммаВключаетНДС = Ложь;	
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)

	Если СуммаВключаетНДС И УчитыватьАкциз Тогда
		СуммаВключаетАкциз = Истина;
	КонецЕсли;
	
	УправлениеФормой(ЭтаФорма);
	
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьАкцизПриИзменении(Элемент)
	
	Если УчитыватьАкциз И СуммаВключаетНДС Тогда
		СуммаВключаетАкциз = Истина;
	ИначеЕсли НЕ УчитыватьАкциз Тогда 
		СуммаВключаетАкциз = Ложь;	
	КонецЕсли;	
	
	УправлениеФормой(ЭтаФорма);
	
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетАкцизПриИзменении(Элемент)
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НДСВключенВСтоимостьПриИзменении(Элемент)
	Модифицированность = ЗначенияИзменились(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьКурсВзаиморасчетов(Команда)
	
	Если ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДатыКурсаВзаиморасчетов", ЭтаФорма);
		ПоказатьВводДаты(ОписаниеОповещения, ДатаКурсаВзаиморасчетов, НСтр("ru = 'Дата курса взаиморасчетов'"), ЧастиДаты.Дата);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Валюта взаиморасчетов не задана'"), , "ВалютаВзаиморасчетов");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыКурсаВзаиморасчетов(Дата, Параметры) Экспорт
	
	Если Дата <> Неопределено Тогда
		
		ДатаКурсаВзаиморасчетов = Дата;
		
		КурсКратность = КурсКратность(ВалютаВзаиморасчетов, ДатаКурсаВзаиморасчетов);
		КурсВзаиморасчетов = КурсКратность.Курс;
		КратностьВзаиморасчетов = КурсКратность.Кратность;
		
		КурсДокумента = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КурсВзаиморасчетов, КурсДокумента);
		КратностьДокумента = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КратностьВзаиморасчетов, КратностьДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКурсДокумента(Команда)
	
	Если ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДатыКурсаДокумента", ЭтаФорма);
		ПоказатьВводДаты(ОписаниеОповещения, ДатаКурсаДокумента, НСтр("ru = 'Дата курса документа'"), ЧастиДаты.Дата);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Валюта документа не задана'"), , "ВалютаДокумента");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДатыКурсаДокумента(Дата, Параметры) Экспорт
	
	Если Дата <> Неопределено Тогда
		
		ДатаКурсаДокумента = Дата;
		
		КурсКратность = КурсКратность(ВалютаДокумента, ДатаКурсаДокумента);
		КурсДокумента = КурсКратность.Курс;
		КратностьДокумента = КурсКратность.Кратность;
		
		КурсВзаиморасчетов = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КурсДокумента, КурсВзаиморасчетов);
		КратностьВзаиморасчетов = ?(ВалютаВзаиморасчетов = ВалютаДокумента, КратностьДокумента, КратностьВзаиморасчетов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗакрытьСохраняяИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Если Модифицированность ИЛИ ПерезаполнитьЦены ИЛИ ПересчитатьЦены Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Данные были изменены. Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ЗакрытьБезСохраненияИзменений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗакрытьСохраняяИзменения();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ЗакрытьБезСохраненияИзменений();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСохраняяИзменения()
	
	Если ФормаЗаполненаКорректно() Тогда
		
		Если Модифицированность ИЛИ ПерезаполнитьЦены ИЛИ ПересчитатьЦены Тогда
			
			Результат = Новый Структура();
			Результат.Вставить("ЗначенияПриОткрытии",              ЗначенияПриОткрытии);
			Результат.Вставить("ЗначенияПриЗакрытии",              ЗначенияПриЗакрытии());
			Результат.Вставить("ЗначенияИзменились",               Модифицированность);
			Результат.Вставить("ПерезаполнитьЦеныПоТипуЦен",       ПерезаполнитьЦены);
			Результат.Вставить("ПересчитатьЦеныПоВалютеДокумента", ПересчитатьЦены);		
			Закрыть(Результат);
			
		Иначе
			
			ЗакрытьБезСохраненияИзменений();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезСохраненияИзменений()
	
	Закрыть(Неопределено);	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с курсами валют

&НаСервере
Процедура ЗаполнитьКурсыВалют()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсыВалютСрезПоследних";
    Запрос.УстановитьПараметр("ДатаДокумента", Параметры.ДанныеДокумента.Дата);
	
	КурсыВалют.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КурсВалюты(Знач Валюта, Знач КурсыВалют)
	
	Перем КурсВалюты;
	
	МассивСтрок = КурсыВалют.НайтиСтроки(Новый Структура("Валюта", Валюта));
	КурсВалюты = ?(МассивСтрок.Количество() <> 0, МассивСтрок[0].Курс, 1);
	
	Возврат КурсВалюты;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КратностьВалюты(Знач Валюта, Знач КурсыВалют)
	
	Перем КратностьВалюты;
	
	МассивСтрок = КурсыВалют.НайтиСтроки(Новый Структура("Валюта", Валюта));
	КратностьВалюты = ?(МассивСтрок.Количество() <> 0, МассивСтрок[0].Кратность, 1);
	
	Возврат КратностьВалюты;
	
КонецФункции

&НаСервереБезКонтекста
Функция КурсКратность(Знач Валюта, Знач Дата)
	
	КурсКратность = Новый Структура("Курс, Кратность", 1, 1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КурсКратность.Курс = Выборка.Курс;
		КурсКратность.Кратность = Выборка.Кратность;		
	КонецЕсли;
	
	Возврат КурсКратность;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции

&НаСервере
Функция ВозможноОткрытьФорму()
	
	ВозможноОткрытьФорму = Истина;
	
	ДанныеДокумента = Параметры.ДанныеДокумента;
	
	Если ДанныеДокумента.Свойство("ДоговорКонтрагента") Тогда 
		
		Если НЕ Параметры.ПараметрыОткрытия.БезКонтроляВалютыВзаиморасчетов Тогда
			
			Если НЕ ЗначениеЗаполнено(ДанныеДокумента.ДоговорКонтрагента) Тогда
				ВозможноОткрытьФорму = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru = 'Не выбран договор контрагента'"), , 
					"Объект.ДоговорКонтрагента");
					
			ИначеЕсли НЕ ЗначениеЗаполнено(ДанныеДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов) Тогда 
				ВозможноОткрытьФорму = Ложь;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru = 'Не выбрана валюта в договоре контрагента'"), , 
					"Объект.ДоговорКонтрагента");
					
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозможноОткрытьФорму;
	
КонецФункции

&НаСервере
Процедура ИзменитьФормуЕслиЭтоВызовПриИзмененииДоговора()

	Если НЕ Параметры.ВызовПриИзмененииДоговора Тогда
		Возврат;	
	КонецЕсли;
	
	РеквизитыДоговора = фин_ОбщегоНазначенияСервер.ЗначенияРеквизитовОбъекта(
		Параметры.ДанныеДокумента.ДоговорКонтрагента, "ВалютаВзаиморасчетов, ТипЦен");
	
	Если Параметры.ДанныеДокумента.Свойство("ТипЦен") 
	   И Параметры.ДанныеДокумента.ТипЦен <> РеквизитыДоговора.ТипЦен Тогда
	   
		ТипЦен = РеквизитыДоговора.ТипЦен;
		ОбработатьИзмененияТипаЦен(ЭтаФорма);
		
	КонецЕсли;
	                  
	Если Параметры.ДанныеДокумента.Свойство("ВалютаДокумента") 
	   И Параметры.ДанныеДокумента.ВалютаДокумента <> РеквизитыДоговора.ВалютаВзаиморасчетов Тогда
	   
		ВалютаДокумента = РеквизитыДоговора.ВалютаВзаиморасчетов;
		ОбработатьИзменениеВалютыДокумента(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция ЗначенияИзменились(Форма)
	
	ЗначенияИзменились = Ложь; 
	
	Для Каждого НачальноеЗначение Из Форма.ЗначенияПриОткрытии Цикл
		ТекущееЗначение = Форма[НачальноеЗначение.Ключ];
		Если ТекущееЗначение <> НачальноеЗначение.Значение Тогда
			ЗначенияИзменились = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЗначенияИзменились;
	
КонецФункции

&НаСервере
Процедура СохранитьЗначенияПриОткрытии()
	
	ЗначенияПриОткрытии = Новый Структура();
	
	Если Параметры.ДанныеДокумента.Свойство("ТипЦен") Тогда
		ЗначенияПриОткрытии.Вставить("ТипЦен", Параметры.ДанныеДокумента.ТипЦен);
	КонецЕсли;
	
	ЗначенияПриОткрытии.Вставить("ВалютаДокумента", ?(Параметры.ДанныеДокумента.Свойство("ВалютаДокумента"), Параметры.ДанныеДокумента.ВалютаДокумента, Справочники.Валюты.ПустаяСсылка()));
	ЗначенияПриОткрытии.Вставить("КурсДокумента", ?(Параметры.ДанныеДокумента.Свойство("КурсДокумента"), Параметры.ДанныеДокумента.КурсДокумента, 0));
	ЗначенияПриОткрытии.Вставить("КратностьДокумента", ?(Параметры.ДанныеДокумента.Свойство("КратностьДокумента"), Параметры.ДанныеДокумента.КратностьДокумента, 0));
	ЗначенияПриОткрытии.Вставить("ВалютаВзаиморасчетов", ?(Параметры.ДанныеДокумента.Свойство("ВалютаВзаиморасчетов"), Параметры.ДанныеДокумента.ВалютаВзаиморасчетов, Справочники.Валюты.ПустаяСсылка()));
	ЗначенияПриОткрытии.Вставить("КурсВзаиморасчетов", ?(Параметры.ДанныеДокумента.Свойство("КурсВзаиморасчетов"), Параметры.ДанныеДокумента.КурсВзаиморасчетов, 0));
	ЗначенияПриОткрытии.Вставить("КратностьВзаиморасчетов", ?(Параметры.ДанныеДокумента.Свойство("КратностьВзаиморасчетов"), Параметры.ДанныеДокумента.КратностьВзаиморасчетов, 0));
	ЗначенияПриОткрытии.Вставить("УчитыватьНДС", ?(Параметры.ДанныеДокумента.Свойство("УчитыватьНДС"), Параметры.ДанныеДокумента.УчитыватьНДС, Ложь));
	ЗначенияПриОткрытии.Вставить("СуммаВключаетНДС", ?(Параметры.ДанныеДокумента.Свойство("СуммаВключаетНДС"), Параметры.ДанныеДокумента.СуммаВключаетНДС, Ложь));
	ЗначенияПриОткрытии.Вставить("УчитыватьАкциз", ?(Параметры.ДанныеДокумента.Свойство("УчитыватьАкциз"), Параметры.ДанныеДокумента.УчитыватьАкциз, Ложь));
	ЗначенияПриОткрытии.Вставить("СуммаВключаетАкциз", ?(Параметры.ДанныеДокумента.Свойство("СуммаВключаетАкциз"), Параметры.ДанныеДокумента.СуммаВключаетАкциз, Ложь));
	ЗначенияПриОткрытии.Вставить("НДСВключенВСтоимость", ?(Параметры.ДанныеДокумента.Свойство("НДСВключенВСтоимость"), Параметры.ДанныеДокумента.НДСВключенВСтоимость, Ложь));
	
КонецПроцедуры

&НаСервере
Функция ЗначенияПриЗакрытии()
	
	ЗначенияПриЗакрытии = Новый Структура;
	
	Для Каждого НачальноеЗначение Из ЗначенияПриОткрытии Цикл
		ИмяРеквизита = НачальноеЗначение.Ключ;
		ЗначенияПриЗакрытии.Вставить(ИмяРеквизита, ЭтаФорма[ИмяРеквизита]);	
	КонецЦикла;
	
	Возврат ЗначенияПриЗакрытии;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормы(ДанныеДокумента)
	
	// Установить значения реквизитов формы.
	
	ДанныеДокумента.Свойство("ТипЦен",ТипЦен);
	ДанныеДокумента.Свойство("ВалютаДокумента",ВалютаДокумента);
	ДанныеДокумента.Свойство("УчитыватьНДС",УчитыватьНДС);
	ДанныеДокумента.Свойство("СуммаВключаетНДС",СуммаВключаетНДС);
	ДанныеДокумента.Свойство("УчитыватьАкциз",УчитыватьАкциз);
	ДанныеДокумента.Свойство("СуммаВключаетАкциз",СуммаВключаетАкциз);
	ДанныеДокумента.Свойство("НДСВключенВСтоимость",НДСВключенВСтоимость);
	
	// Установить реквизит ВалютаВзаиморасчетов.
	//Если ДанныеДокумента.Свойство("ДоговорКонтрагента") Тогда
	//	ВалютаВзаиморасчетов = ДанныеДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	//ИначеЕсли ДанныеДокумента.Свойство("ВалютаВзаиморасчетов") Тогда
	//	ВалютаВзаиморасчетов = ДанныеДокумента.ВалютаВзаиморасчетов;
	//КонецЕсли;
	Если ДанныеДокумента.Свойство("ВалютаВзаиморасчетов") Тогда
		ВалютаВзаиморасчетов = ДанныеДокумента.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	// Установить реквизиты КурсВзаиморасчетов, КратностьВзаиморасчетов.
	Если ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		Если ВалютаВзаиморасчетов = ВалютаДокумента Тогда
			КурсВзаиморасчетов = ДанныеДокумента.КурсВзаиморасчетов;
			КратностьВзаиморасчетов = ДанныеДокумента.КратностьВзаиморасчетов;
		ИначеЕсли ДанныеДокумента.Свойство("ВалютаВзаиморасчетов") Тогда
			КурсВзаиморасчетов = ДанныеДокумента.КурсВзаиморасчетов;
			КратностьВзаиморасчетов = ДанныеДокумента.КратностьВзаиморасчетов;
		Иначе 
			КурсВзаиморасчетов = КурсВалюты(ВалютаВзаиморасчетов, КурсыВалют);
			КратностьВзаиморасчетов = КратностьВалюты(ВалютаВзаиморасчетов, КурсыВалют);			
		КонецЕсли;
	КонецЕсли;
	
	// Установить реквизиты КурсДокумента, КратностьДокумента.
	Если ДанныеДокумента.Свойство("КурсДокумента") И ДанныеДокумента.Свойство("КратностьДокумента") Тогда
		КурсДокумента = ДанныеДокумента.КурсДокумента;
		КратностьДокумента = ДанныеДокумента.КратностьДокумента;		
	Иначе
		// возможна ситуация, когда валюта документа передается, а курс - не передается
		// чтобы при этом не было нулевого курса, будем заполнять его руками
		// в случае наличия курса взаиморасчетов и совпадения валюты взаиморасчетов с валютой
		// документа - будем брать курс взаиморасчетов, иначе - текущий курс
		Если ВалютаДокумента = ВалютаВзаиморасчетов Тогда
			КурсДокумента = КурсВзаиморасчетов;
			КратностьДокумента = КратностьВзаиморасчетов;
		Иначе
			Если ДанныеДокумента.Свойство("КурсВзаиморасчетов") И ДанныеДокумента.Свойство("КратностьВзаиморасчетов") Тогда
				КурсДокумента = ?(ЗначениеЗаполнено(ДанныеДокумента.КурсВзаиморасчетов), ДанныеДокумента.КурсВзаиморасчетов,  КурсВалюты(ВалютаДокумента, КурсыВалют));
				КратностьДокумента = ?(ЗначениеЗаполнено(ДанныеДокумента.КратностьВзаиморасчетов), ДанныеДокумента.КратностьВзаиморасчетов, КратностьВалюты(ВалютаДокумента, КурсыВалют));
			Иначе
				КурсДокумента = КурсВалюты(ВалютаДокумента, КурсыВалют);
				КратностьДокумента = КратностьВалюты(ВалютаДокумента, КурсыВалют);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияПриОткрытии.Вставить("КурсДокумента", КурсДокумента);
	ЗначенияПриОткрытии.Вставить("КратностьДокумента", КратностьДокумента);
	
	ЗначенияПриОткрытии = Новый ФиксированнаяСтруктура(ЗначенияПриОткрытии);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораВалютаДокумента()
	
	Если Параметры.ДанныеДокумента.Свойство("ВалютаДокумента") Тогда
		
		Если НЕ Параметры.ПараметрыОткрытия.БезКонтроляВалютыВзаиморасчетов Тогда
			
			Элементы.ВалютаДокумента.СписокВыбора.Добавить(ВалютаУчета);
			
			Если ЗначениеЗаполнено(ВалютаДокумента) И ВалютаДокумента <> ВалютаУчета Тогда
				Элементы.ВалютаДокумента.СписокВыбора.Добавить(ВалютаДокумента);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВалютаВзаиморасчетов) И ВалютаВзаиморасчетов <> ВалютаУчета Тогда
				Элементы.ВалютаДокумента.СписокВыбора.Добавить(ВалютаВзаиморасчетов);
			КонецЕсли;
			
			Если Параметры.ДанныеДокумента.Свойство("ДоговорКонтрагента") И ЗначениеЗаполнено(Параметры.ДанныеДокумента.ДоговорКонтрагента) И ВалютаДокумента <> Параметры.ДанныеДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов Тогда
				Элементы.ВалютаДокумента.СписокВыбора.Добавить(Параметры.ДанныеДокумента.ДоговорКонтрагента.ВалютаВзаиморасчетов);
			КонецЕсли;
			
		Иначе 
			
			Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "
				|ВЫБРАТЬ
				|	Валюты.Ссылка КАК Валюта
				|ИЗ
				|	Справочник.Валюты КАК Валюты
				|УПОРЯДОЧИТЬ ПО
				|	Валюта";
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ВалютаДокумента = Выборка.Валюта;
				КонецЕсли;
				
				Если Параметры.ПараметрыОткрытия.ЕстьЗаполненныеТабличныеЧасти Тогда
					ПересчитатьЦены = Истина;
				КонецЕсли;
				
			КонецЕсли;
				
			Элементы.ВалютаДокумента.КнопкаВыбора  = Истина;
			Элементы.ВалютаДокумента.РежимВыбораИзСписка = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма, СозданиеФормы = Ложь)
	
	Если СозданиеФормы Тогда
		
		Форма.Элементы.ТипЦен.Видимость                       = Форма.Параметры.ДанныеДокумента.Свойство("ТипЦен");
		Форма.Элементы.ПерезаполнитьЦены.Видимость            = Форма.Параметры.ДанныеДокумента.Свойство("ТипЦен");
		Форма.Элементы.ВалютаДокумента.Видимость              = Форма.Параметры.ДанныеДокумента.Свойство("ВалютаДокумента");
		Форма.Элементы.КурсДокумента.Видимость                = Форма.Параметры.ДанныеДокумента.Свойство("ВалютаДокумента");
		Форма.Элементы.КратностьДокумента.Видимость           = Форма.Параметры.ДанныеДокумента.Свойство("ВалютаДокумента");
		Форма.Элементы.ПересчитатьЦены.Видимость              = Форма.Параметры.ДанныеДокумента.Свойство("ВалютаДокумента");
		Форма.Элементы.УстановитьКурсДокумента.Видимость      = Форма.Параметры.ДанныеДокумента.Свойство("ВалютаДокумента");
		Форма.Элементы.ВалютаВзаиморасчетов.Видимость         = ЗначениеЗаполнено(Форма.ВалютаВзаиморасчетов); 
		Форма.Элементы.КурсВзаиморасчетов.Видимость           = ЗначениеЗаполнено(Форма.ВалютаВзаиморасчетов); 
		Форма.Элементы.КратностьВзаиморасчетов.Видимость      = ЗначениеЗаполнено(Форма.ВалютаВзаиморасчетов);
		Форма.Элементы.УстановитьКурсВзаиморасчетов.Видимость = ЗначениеЗаполнено(Форма.ВалютаВзаиморасчетов);
		Форма.Элементы.УчитыватьНДС.Видимость                 = Форма.Параметры.ДанныеДокумента.Свойство("УчитыватьНДС");
		Форма.Элементы.СуммаВключаетНДС.Видимость             = Форма.Параметры.ДанныеДокумента.Свойство("СуммаВключаетНДС");
		Форма.Элементы.УчитыватьАкциз.Видимость               = Форма.Параметры.ДанныеДокумента.Свойство("УчитыватьАкциз");
		Форма.Элементы.СуммаВключаетАкциз.Видимость           = Форма.Параметры.ДанныеДокумента.Свойство("СуммаВключаетАкциз");
		Форма.Элементы.НДСВключенВСтоимость.Видимость         = Форма.Параметры.ДанныеДокумента.Свойство("НДСВключенВСтоимость");	
		
		Форма.Элементы.КурсДокумента.Доступность      = Форма.Параметры.ДанныеДокумента.Свойство("КурсДокумента");
		Форма.Элементы.КратностьДокумента.Доступность = Форма.Параметры.ДанныеДокумента.Свойство("КратностьДокумента");
		
		Для Каждого НедоступныйРеквизит Из Форма.Параметры.ПараметрыОткрытия.НедоступныеРеквизиты Цикл
			
			Если НедоступныйРеквизит.Значение <> Неопределено
				И (ТипЗнч(НедоступныйРеквизит.Значение) = Тип("Соответствие")
					ИЛИ ТипЗнч(НедоступныйРеквизит.Значение) = Тип("Структура")) Тогда
					
				Для Каждого СвойствоЭлемента Из НедоступныйРеквизит.Значение Цикл
					ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
						Форма.Элементы, НедоступныйРеквизит.Ключ, СвойствоЭлемента.Ключ, СвойствоЭлемента.Значение);
				КонецЦикла;
			Иначе 
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
					Форма.Элементы, НедоступныйРеквизит.Ключ, "Доступность", Ложь);
			КонецЕсли;
		КонецЦикла;
		
		//Если НЕ Форма.Параметры.ПараметрыОткрытия.ЕстьЗаполненныеТабличныеЧасти Тогда 
		//	Форма.Элементы.ПерезаполнитьЦены.Доступность            = Ложь;
		//	Форма.Элементы.ПересчитатьЦены.Доступность              = Ложь;
		//КонецЕсли;
		
	КонецЕсли;
	
	// Доступность флажка СуммаВключаетНДС.
	Если Форма.УчитыватьНДС Тогда
		Форма.Элементы.СуммаВключаетНДС.Доступность = Истина И НЕ Форма.Параметры.ПараметрыОткрытия.НедоступныеРеквизиты.Свойство("СуммаВключаетНДС");
	Иначе
		Форма.Элементы.СуммаВключаетНДС.Доступность = Ложь;
	КонецЕсли;
	
	// Доступность флажка СуммаВключаетАкциз.		
	Если (НЕ Форма.УчитыватьАкциз) ИЛИ (Форма.УчитыватьАкциз И Форма.СуммаВключаетНДС) Тогда
		Форма.Элементы.СуммаВключаетАкциз.Доступность = Ложь;
	Иначе
		Форма.Элементы.СуммаВключаетАкциз.Доступность = Истина И НЕ Форма.Параметры.ПараметрыОткрытия.НедоступныеРеквизиты.Свойство("СуммаВключаетАкциз");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РеквизитыТипаЦен(Знач ТипЦен)

	Реквизиты = Новый Структура("ЦенаВключаетНДС, ЦенаВключаетАкциз", 
		ТипЦен.ЦенаВключаетНДС, ТипЦен.ЦенаВключаетАкциз);
		
	Возврат Реквизиты;
	
КонецФункции

&НаКлиенте
Функция ФормаЗаполненаКорректно()

	ЗаполненыКорректно = Истина; 	

	// ТипЦен
	Если ПерезаполнитьЦены И НЕ ЗначениеЗаполнено(ТипЦен) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Тип цен не задан'"), , "ТипЦен");
		ЗаполненыКорректно = Ложь;
	КонецЕсли;	
	
	// ВалютаДокумента
	Если Элементы.ВалютаДокумента.Видимость И НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Валюта документа не задана'"), , "ВалютаДокумента");	
		ЗаполненыКорректно = Ложь;	
	КонецЕсли;
	
	// КурсВзаиморасчетов	
	Если Элементы.КурсВзаиморасчетов.Видимость И НЕ ЗначениеЗаполнено(КурсВзаиморасчетов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Курс взаиморасчетов не задан'"), , "КурсВзаиморасчетов");	
		ЗаполненыКорректно = Ложь;	
	КонецЕсли;
	
	// КратностьВзаиморасчетов
	Если Элементы.КратностьВзаиморасчетов.Видимость И НЕ ЗначениеЗаполнено(КратностьВзаиморасчетов) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Кратность взаиморасчетов не задана'"), , "КратностьВзаиморасчетов");	
		ЗаполненыКорректно = Ложь;	
	КонецЕсли;
	
	Возврат ЗаполненыКорректно;

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Для Каждого НачальноеЗначение Из ЗначенияПриОткрытии Цикл
		ИмяРеквизита = НачальноеЗначение.Ключ;
		ЭтаФорма[ИмяРеквизита] = НачальноеЗначение.Значение;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка =Параметры.ПараметрыОткрытия.БезКонтроляВалютыВзаиморасчетов;
	ДанныеВыбора = Элемент.СписокВыбора;
КонецПроцедуры
